app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "hello"], ["body", "y3g3ygey3ege2eyg2eg"], ["created_at", "2024-08-22 18:47:38.072970"], ["updated_at", "2024-08-22 18:47:38.072970"], ["status", "public"]]
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "hello"], ["body", "this is a tst"], ["created_at", "2024-08-22 22:59:57.437981"], ["updated_at", "2024-08-22 22:59:57.437981"], ["status", "public"]]
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2024-08-23 19:29:27.626948"], ["id", 12]]
---
  def create
    @article = Article.create!(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2024-08-26 16:07:25.356453"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)