app/controllers/comments_controller.rb

    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Bob"], ["body", "Wow!"], ["article_id", 4], ["created_at", "2024-08-22 23:00:11.382054"], ["updated_at", "2024-08-22 23:00:11.382054"], ["status", "public"]]